Repository: CofficLab/Lumi
Catalog: Plugins/ChatModePlugin/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk, zh_tw

source: Auto-approve risk
zh_hans: 风险自动批准
zh_hk: 風險自動批准
zh_tw: 風險自動核准

# Autonomous Mode Description
source: Autonomous mode: tools and code changes, high-risk auto-approved
zh_hans: 自主模式：可执行工具和修改代码，高风险自动批准
zh_hk: 自主模式：可執行工具和修改代碼，高風險自動批准
zh_tw: 自主模式：可執行工具和修改程式碼，高風險自動核准

# Autonomous Mode Help
source: A3 Autonomous: tools and code changes, high-risk auto-approved
zh_hans: A3 自主：可执行工具，高风险自动批准
zh_hk: A3 自主：可執行工具，高風險自動批准
zh_tw: A3 自主：可執行工具，高風險自動核准

# Autonomous Mode Name
source: Autonomous
zh_hans: 自主
zh_hk: 自主
zh_tw: 自主

source: Autonomy Level
zh_hans: 自主级别
zh_hk: 自主級別
zh_tw: 自主級別

# Build Mode Description
source: Build mode: tools and code changes, high-risk requires confirmation
zh_hans: 构建模式：可执行工具和修改代码，高风险需要确认
zh_hk: 構建模式：可執行工具和修改代碼，高風險需要確認
zh_tw: 建置模式：可執行工具和修改程式碼，高風險需要確認

# Build Mode Help
source: A2 Build: tools available, high-risk requires confirmation
zh_hans: A2 构建：可执行工具，高风险需确认
zh_hk: A2 構建：可執行工具，高風險需確認
zh_tw: A2 建置：可執行工具，高風險需確認

# Build Mode Name
source: Build
zh_hans: 构建
zh_hk: 構建
zh_tw: 建置

source: Chat Mode
zh_hans: 聊天模式
zh_hk: 聊天模式
zh_tw: 對話模式

# Chat Mode Description
source: Chat mode: chat only, no actions performed
zh_hans: 对话模式：只聊天，不执行任何操作
zh_hk: 對話模式：只聊天，不執行任何操作
zh_tw: 對話模式：只聊天，不執行任何操作

# Chat Mode Help
source: A1 Chat: chat only, no actions performed
zh_hans: A1 对话：只聊天，不执行操作
zh_hk: A1 對話：只聊天，不執行操作
zh_tw: A1 對話：只聊天，不執行操作

# Chat Mode Hint
source: Switch between chat, build, and autonomous modes
zh_hans: 切换对话、构建或自主模式
zh_hk: 切換對話、構建或自主模式
zh_tw: 切換對話、建置或自主模式

# Chat Mode Name
source: Chat
zh_hans: 对话
zh_hk: 對話
zh_tw: 對話

source: Confirm risk
zh_hans: 风险需确认
zh_hk: 風險需確認
zh_tw: 風險需確認

source: No code changes
zh_hans: 不改代码
zh_hk: 不改代碼
zh_tw: 不改程式碼

source: Switch between Chat and Build modes
zh_hans: 在聊天和构建模式之间切换
zh_hk: 在聊天和構建模式之間切換
zh_tw: 在聊天和構建模式之間切換

source: Tools off
zh_hans: 工具关闭
zh_hk: 工具關閉
zh_tw: 工具關閉

source: Tools on
zh_hans: 工具可用
zh_hk: 工具可用
zh_tw: 工具可用

# 自动化程度
source: Automation Level
zh_hans: 自动化程度
zh_hk: 自動化程度
zh_tw: 自動化程度
